user/tutorials/Nike/ISAT_paper/shockDropletANN/constant/chem
elements        
3
(
H
O
C
)
;


species        2(N2 C6H14);


reactions
{
}

Tlow            200;
Thigh           6000;

